import { Col, Container, Row } from "react-bootstrap";
import TopThreeNews from "../../components/news/TopThreeNews.js";
import newsImage from "../../public/assets/images/Group.png"
import Link from 'next/link'
function BlogItem() {
    const NewsData = [
        {
            id : 1,
            date : "شهریور 1404",
            title : "عنوان مقاله اول",
            image : "https://upload.wikimedia.org/wikipedia/commons/4/4f/Foolad_Mobarakeh7.jpg",
            category : "فولاد صنعت ایران",
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و باایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت  استفاده از طراحان گرافیک است"
        },
        {
            id : 2,
            date : "دی 1403",
            title : "عنوان مقاله دوم",
            image : "https://upload.wikimedia.org/wikipedia/commons/4/4f/Foolad_Mobarakeh7.jpg",
            category : "فولاد مرکزی بافق",
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"
        },
        {
            id : 3,
            date : "تیر 1404",
            title : "عنوان مقاله سوم",
            image : "https://upload.wikimedia.org/wikipedia/commons/4/4f/Foolad_Mobarakeh7.jpg",
            category : "فولاد صنعت ایران",
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"
        }
        ,
        {
            id : 4,
            date : "فروردین 1404",
            title : "عنوان مقاله چهارم",
            image : "https://upload.wikimedia.org/wikipedia/commons/4/4f/Foolad_Mobarakeh7.jpg",
            category : "فولاد صنعت ایران",
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"
        },
        {
            id : 5,
            date : "اسفند 1403",
            title : "عنوان مقاله پنجم",
            image : "https://upload.wikimedia.org/wikipedia/commons/4/4f/Foolad_Mobarakeh7.jpg",
            category : "فولاد مرکزی بافق",
            desc : "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفادهاستلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است"
        },
    ];
    return (
        <Container className="m-auto mt-5">
                <Row className="flex items-center justify-between">
                    <Col lg="6" className="my-5">
                        <Row className="flex flex-col gap-y-8">
                            <h1 className="h1">آخرین وبلاگ ها</h1>
                            <p className="text-justify">
                            لورم ایپسوم فارسی، تولید کننده متن ساختگی فارسی و انگلیسی برای طراحان وب و گرافیست ها همراه با امکان ایجاد متن تصادفی در طول‌های مختلف.
                            لورم ایپسوم فارسی، تولید کننده متن ساختگی فارسی و انگلیسی برای طراحان وب و گرافیست ها همراه با امکان ایجاد متن تصادفی در طول‌های مختلف.
                            </p>
                            <div className="flex justify-start w-full">
                                <Link href="/blog" className="border-2 w-full !border-[#292a71] px-3 py-2 rounded-xl flex items-center justify-center gap-x-3 hover:!bg-[#292a71] hover:text-white duration-200">
                                    <span>دیدن همه وبلاگ ها</span>
                                </Link>
                            </div>
                        </Row>
                    </Col>
                    <Col lg="6" className="flex flex-col gap-y-6">
                        {
                            NewsData.slice(0 , 3).map( item => (
                                <TopThreeNews key={item.id} {...item} />
                            ) )
                        }
                    </Col>
                </Row>
            </Container>
    );
}

export default BlogItem;